{
  "hero_section": {
    "hero-nav": {
      "about": "Обо мне",
      "skills": "Навыки",
      "portfolio": "Портфолио",
      "contact": "Связаться со мной"
    },
    "hero_title": {
      "span": "Привет, я",
      "main": "Эльчин Мамедов",
      "desc": "Фронтенд-разработчик"
    },

    "frontend_title": "Фронтенд",
    "frontend_desc": "Фронтенд — это часть веб-сайта или веб-приложения, которая напрямую взаимодействует с пользователем. Когда пользователь заходит на сайт, всё, что он видит — дизайн, кнопки, анимации и общий опыт — реализовано с помощью фронтенд-технологий. Основная задача frontend-а — визуально и интерактивно представить данные, обеспечивая удобный, интуитивно понятный и привлекательный пользовательский опыт. В современном мире люди ожидают не только работоспособности, но и скорости, адаптивности и эстетики, поэтому frontend играет важную роль как с технической, так и с дизайнерской стороны. Успех любого цифрового продукта невозможен без сильной frontend-основы."
  },

  "about_section": {
    "about_me": "ОБО МНЕ",
    "about_description": "Я Frontend-разработчик, сосредоточенный на создании современных пользовательских интерфейсов с приоритетом на удобство использования. Разрабатываю динамичные, адаптивные и функциональные веб-интерфейсы с использованием React и других технологий. Для меня превращение дизайна в код — это не просто работа, а настоящий творческий процесс.",
    "explore": "Исследовать",
    "design": {
      "title": "DESIGN",
      "description": "Я сосредоточен на создании удобных для пользователей интерфейсов — кодирую интуитивно понятные интерфейсы, используя Figma и другие дизайнерские инструменты."
    },
    "development": {
      "title": "DEVELOPMENT",
      "description": "Я создаю производительные и гибкие веб-сайты с использованием современного React и других передовых технологий."
    },
    "maintenance": {
      "title": "MAINTENANCE",
      "description": "Я обеспечиваю постоянную поддержку и обновления, чтобы ваши проекты оставались стабильными и эффективными."
    }
  },

  "skills_section": {
    "title": "НАВЫКИ",
    "info": "Использую сейчас"
  },

  "portfolio_section": {
    "title": "ПОРТФОЛИО",
    "projects": "Проекты",
    "code": "Коды",
    "desc": "И многое другое..."
  },

  "contact_section": {
    "title": "КОНТАКТЫ",
    "description": "Не стесняйтесь обращаться с вопросами или для сотрудничества, или напишите через форму ниже"
  },

  "form": {
    "success_message": "Ваше сообщение отправлено!",
    "sending": "Отправка...",
    "name_placeholder": "Введите ваше имя",
    "email_placeholder": "Введите вашу почту",
    "phone_placeholder": "Номер телефона",
    "message_placeholder": "Ваше сообщение",
    "submit_button": "ОТПРАВИТЬ"
  },

  "scroll_top": "Наверх",

  "copyright": "© 2025 Эльчин Мамедов Все права защищены"
}
